Public Attributes | List of all members
API_Point Struct Reference
Geolocation
Pixel data. More...
#include <APIdefs_Base.h>
 Public Attributes
short  | v
vertical coordinate
short  | h
horizontal coordinate
Detailed Description
Pixel data.
Remarks
An integer type representation of an API_Coord. Expressed in the local coordinates of the window, based on pixels from the top/left corner. Refer to the ACAPI_View_CoordToPoint and ACAPI_View_CoordToPoint conversion functions for further details.
Member Data Documentation
◆ h
 API_Point::h
horizontal coordinate
◆ v
 API_Point::v
vertical coordinate